read_verilog -sv <<EOT
module top;
    logic [7:0] in_d;
    logic [3:0] cnt;
    countbits_ops dut (
        .in_d(in_d),
        .cnt(cnt)
    );

    assign in_d = 8'h8F; // Hardcoded input value

    always_comb assert(cnt == 4'd6); // Assert that cnt equals 5, since there are five 1's in 8'h8F
endmodule

module countbits_ops (
    input logic [7:0] in_d,
    output logic [3:0] cnt
);
    assign cnt = $countbits(in_d, 1'b1);
endmodule
EOT

prep -top top
write_verilog -noattr countbits_test.sv
chformal -lower
select top
sat -prove-asserts -verify
